src/gena/transgen-ria-error-1.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RegisterOperation xmlns="http://www.ukrgasbank.com"><TransferId>47702216</TransferId><TransferNumber>12990240722</TransferNumber><SystemCode>ri</SystemCode><SystemName>RIA</SystemName><Operation>2</Operation><Type>1</Type><OperationDate>2021-04-05T15:40:31+03:00</OperationDate><PayoutDate>2021-04-05T15:26:58+03:00</PayoutDate><OperationCashDesk>0</OperationCashDesk><ABSDate>2021-04-05T00:00:00+03:00</ABSDate><TransferAmount>251.0000</TransferAmount><FromCountry>840</FromCountry><ToCountry>804</ToCountry><TransferСurrency>978</TransferСurrency><PointBank>1000045</PointBank><PointSW>GASB0216</PointSW><UserLogin>nhorobets</UserLogin><UserName>Горобець Наталія Леонідівна</UserName><UserID>13673</UserID><Sender><LastName>ROSSI</LastName><FirstName>VINCENT</FirstName><Residency>false</Residency></Sender><Receiver><LastName>FERREIRA DASILVA</LastName><FirstName>ALESSANDRO</FirstName><Residency>false</Residency><DocumentName>TEMPORARY RESIDENCE PERMIT</DocumentName><DocumentNumber>800158222</DocumentNumber><DocumentIssuedBy>8011</DocumentIssuedBy><DateofBirth>1974-03-20</DateofBirth></Receiver></RegisterOperation></soap:Body></soap:Envelope>